In [1]:
import pandas as pd
import numpy as np

In [3]:
dataset = pd.read_csv("Dataset.csv")

Analiza setului de date

In [4]:
dataset.shape

(11, 4)

In [7]:
dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0       No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0       No
3    Spain  38.0  61000.0       No
4  Germany  40.0      NaN       Yes

In [8]:
data_types = dataset.dtypes
print(data_types)

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [9]:
isnull = dataset.isnull()
print(isnull)

    Country    Age  Salary  Purchased
0     False  False   False      False
1     False  False   False      False
2     False  False   False      False
3     False  False   False      False
4     False  False    True      False
5     False  False   False      False
6     False   True   False      False
7     False  False   False      False
8     False  False   False      False
9     False  False   False      False
10    False  False   False      False

In [10]:
isnull = dataset.isnull().sum()
print(isnull)

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [11]:
dataset.describe()

             Age        Salary
count  10.000000     10.000000
mean   38.700000  63500.000000
std     7.257946  11597.413505
min    27.000000  48000.000000
25%    35.500000  55000.000000
50%    38.000000  61000.000000
75%    43.000000  70750.000000
max    50.000000  83000.000000

In [12]:
dataset.describe(include = "all")

       Country        Age        Salary Purchased
count       11  10.000000     10.000000        11
unique       3        NaN           NaN         2
top     France        NaN           NaN       No
freq         4        NaN           NaN         6
mean       NaN  38.700000  63500.000000       NaN
std        NaN   7.257946  11597.413505       NaN
min        NaN  27.000000  48000.000000       NaN
25%        NaN  35.500000  55000.000000       NaN
50%        NaN  38.000000  61000.000000       NaN
75%        NaN  43.000000  70750.000000       NaN
max        NaN  50.000000  83000.000000       NaN

In [13]:
dataset = dataset.drop_duplicates()
dataset.describe()

In [16]:
X = dataset[['Country', 'Age', 'Salary']]
Y = dataset['Purchased']

In [17]:
print(X)

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [18]:
print(Y)

0    No
1    Yes
2    No
3    No
4    Yes
5    Yes
6    No
7    Yes
8    No
9    Yes
Name: Purchased, dtype: object

Tratarea parametrilor lipsa

In [21]:
mean_age = X['Age'].mean()
X.fillna({'Age': mean_age}, inplace = True)

C:\Users\Zbook\AppData\Local\Temp\ipykernel_8076\3393505626.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X.fillna({'Age': mean_age}, inplace = True)

In [22]:
mean_salary = X['Salary'].mean()
X.fillna({'Salary': mean_salary}, inplace=True)
print(X)

   Country        Age        Salary
0   France  44.000000  72000.000000
1    Spain  27.000000  48000.000000
2  Germany  30.000000  54000.000000
3    Spain  38.000000  61000.000000
4  Germany  40.000000  63777.777778
5   France  35.000000  58000.000000
6    Spain  38.777778  52000.000000
7   France  48.000000  79000.000000
8  Germany  50.000000  83000.000000
9   France  37.000000  67000.000000

C:\Users\Zbook\AppData\Local\Temp\ipykernel_8076\1729325441.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X.fillna({'Salary': mean_salary}, inplace=True)

Transformarea coloanelor categoriale

In [25]:
X = pd.get_dummies(X, columns=['Country'])
print(X)

         Age        Salary  Country_France  Country_Germany  Country_Spain
0  44.000000  72000.000000            True            False          False
1  27.000000  48000.000000           False            False           True
2  30.000000  54000.000000           False             True          False
3  38.000000  61000.000000           False            False           True
4  40.000000  63777.777778           False             True          False
5  35.000000  58000.000000            True            False          False
6  38.777778  52000.000000           False            False           True
7  48.000000  79000.000000            True            False          False
8  50.000000  83000.000000           False             True          False
9  37.000000  67000.000000            True            False          False

In [32]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder() # transformare valori boolene in 0 si 1
Y = le.fit_transform(Y)

In [33]:
# normalizarea datelor ( a coloanelor)
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

X = scaler.fit_transform(X)

print(X)

[[0.73913043 0.68571429 1.         0.         0.        ]
 [0.         0.         0.         0.         1.        ]
 [0.13043478 0.17142857 0.         1.         0.        ]
 [0.47826087 0.37142857 0.         0.         1.        ]
 [0.56521739 0.45079365 0.         1.         0.        ]
 [0.34782609 0.28571429 1.         0.         0.        ]
 [0.51207729 0.11428571 0.         0.         1.        ]
 [0.91304348 0.88571429 1.         0.         0.        ]
 [1.         1.         0.         1.         0.        ]
 [0.43478261 0.54285714 1.         0.         0.        ]]